[{
    "name": "Stuffed Acorn Squash with Quinoa, Cranberries, and Pecans",
    "ingredients": [
        "2 acorn squashes",
        "1 cup quinoa, rinsed",
        "2 cups vegetable broth",
        "1 tablespoon olive oil",
        "1 onion, finely chopped",
        "2 cloves garlic, minced",
        "1 teaspoon dried thyme",
        "1 teaspoon dried sage",
        "1/2 cup dried cranberries",
        "1/2 cup chopped pecans",
        "Salt and pepper to taste",
        "Fresh parsley for garnish]"
    ],
    "instructions": "Preheat your oven to 375°F (190°C). Place halved and seeded acorn squashes on a baking sheet, cut side up. Brush with olive oil, sprinkle with salt and pepper, and roast for 30-40 minutes until fork-tender. While the squash is roasting, rinse 1 cup of quinoa, then cook it in 2 cups of vegetable broth for 15-20 minutes until done. In a skillet, sauté 1 finely chopped onion and 2 minced cloves of garlic in 1 tablespoon of olive oil until softened. Add 1 teaspoon each of dried thyme and sage, 1/2 cup each of dried cranberries and chopped pecans; cook for an additional 2-3 minutes. Mix in the cooked quinoa, season with salt and pepper. Fill each roasted acorn squash half with the quinoa mixture. Return to the oven and bake for an additional 15-20 minutes. Garnish with fresh parsley, then serve and enjoy your delicious vegan Thanksgiving meal! Customize as desired and consider adding a drizzle of balsamic glaze or maple syrup for extra flavor."
},
{
    "name": "Set Dosa",
    "ingredients": [
        "1 cup rice",
        "1 cup flattened rice (poha)",
        "1/2 cup urad dal (split black gram)",
        "1/4 cup chana dal (split Bengal gram)",
        "1/2 cup thick or medium semolina (rava)",
        "1/2 cup curd (yogurt)",
        "1 teaspoon sugar",
        "1/2 teaspoon baking soda",
        "Salt to taste",
        "Oil or ghee for cooking"
    ],
    "instructions": "Soak 1 cup of rice and 1/2 cup of urad dal together, and 1/4 cup of chana dal separately, in water for 4-6 hours or overnight. After soaking, drain the water and grind rice and urad dal together to form a smooth batter. Grind soaked chana dal with flattened rice (poha) to create a paste, and add it to the rice and urad dal batter. Mix the batter well, add salt, sugar, and let it ferment for 8-12 hours or overnight. After fermentation, the batter will rise. Add 1/2 cup of semolina (rava) and 1/2 teaspoon of baking soda to the batter. Mix thoroughly."
}
]